#// ייבוא הספריות הדרושות לעבודה עם מצלמה, רשת ותקשורת
#include "esp_camera.h"      // ספריית הליבה של מצלמות ESP32
#include <WiFi.h>            // ספרייה לניהול חיבור אינטרנט אלחוטי
#include <HTTPClient.h>      // ספרייה לשליחת בקשות רשת (POST) לענן
#include <HardwareSerial.h>  // ספרייה לניהול ערוצי תקשורת טורית נוספים לחומרה

// יצירת אובייקט תקשורת בשם MainController, נשתמש בערוץ החומרה מספר 1 (UART1)
HardwareSerial MainController(1); 

void setup() {
  // פתיחת ערוץ התקשורת הסטנדרטי למחשב במהירות 115200 (לצורכי דיבאג ומעקב מסך Serial)
  Serial.begin(115200); 
  
  // קריאה לפונקציות האתחול הנמצאות בלשוניות האחרות
  initUART();   // אתחול התקשורת מול הבקר הראשי
  initWiFi();   //אתחול חיבור הווייפיי לאינטרנט הביתי 
  initCamera(); // הגדרת פינים ואתחול החומרה של העדשה
  
  // הדפסה למחשב שהמערכת סיימה לעלות בהצלחה
  Serial.println("ESP32-CAM System Ready!"); 
}

void loop() {
  // הלולאה הראשית שומרת על ניקיון ורק מפעילה את פונקציית ההאזנה לבקר הראשי ברקע
  checkMainControllerCommand(); 
}