// ==========================================
// קוד לשליטה בטבעת לדים WS2812B ("העין של הרובוט")
// ==========================================
// GND ➔ GND
// VCC ➔5V 
// DI ➔ 4 
#include <Adafruit_NeoPixel.h> // ייבוא הספרייה שמאפשרת תקשורת עם לדים חכמים מסוג WS2812B

#define LED_PIN    4  // הגדרת הפין הדיגיטלי בבקר אליו מחובר קו הנתונים  של טבעת הלדים
#define NUM_LEDS   12 // הגדרת מספר הלדים הפיזיים הקיימים בטבעת (בדגם יש 12 לדים)

// יצירת אובייקט בשם 'eyeRing' לשליטה בלדים, תוך העברת כמות הלדים, הפין הנבחר, ותדר העבודה של הרכיב
Adafruit_NeoPixel eyeRing(NUM_LEDS, LED_PIN, NEO_GRB + NEO_KHZ800);

// פונקציית אתחול - יש לקרוא לה פעם אחת בתוך פונקציית ה-setup() הראשית
void setupEye() {
  eyeRing.begin();           // הפעלת התקשורת והגדרת הפין שנבחר כפלט (OUTPUT)
  eyeRing.show();            // שליחת פקודת רענון לטבעת מיד בהתחלה כדי לוודא שכל הלדים כבויים
  eyeRing.setBrightness(50); // הגבלת עוצמת ההארה ל-50 (מתוך 255 מקסימום) כדי לחסוך בסוללה ולמנוע סנוור
}

//(isMoving) פונקציית הפעלה - מקבלת משתנה בוליאני  שאומר לה אם הרובוט זז או לא
void updateEyeState(bool isMoving) {
  
  if (isMoving == true) { // בדיקת תנאי: האם הרובוט כרגע בתנועה?
    
    // לולאה שרצה מאפס ועד 11 (סה"כ 12 פעמים, כמספר הלדים)
    for(int i = 0; i < NUM_LEDS; i++) {
      // הגדרת צבע לכל לד בנפרד (אדום:0, ירוק:150, כחול:255) שיוצר גוון תכלת מואר
      eyeRing.setPixelColor(i, eyeRing.Color(0, 150, 255)); 
    }
    
  } else { //isMoving=false אם התנאי לא התקיים כלומר והרובוט עומד
    
    // לולאה שרצה שוב על כל הלדים בטבעת
    for(int i = 0; i < NUM_LEDS; i++) {
      // הגדרת הערכים (0,0,0) מכבה לחלוטין את הלד הנוכחי
      eyeRing.setPixelColor(i, eyeRing.Color(0, 0, 0)); 
    }
  }
  
  eyeRing.show(); // פקודה הכרחית: דחיפת הנתונים שהגדרנו בלולאות אל הטבעת עצמה כדי שהאור ישתנה בפועל
}